tap "antoniorodr/memo"
tap "d12frosted/emacs-plus"
tap "farion1231/ccswitch"
tap "fermyon/tap"
tap "gromgit/fuse"
tap "heroku/brew"
tap "humanlayer/humanlayer"
tap "launchdarkly/tap"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
tap "ramiawar/dataline"
tap "spinframework/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "thoughtbot/formulae"
tap "tursodatabase/tap"
tap "tw93/tap"
tap "xdevplatform/tap"
tap "yakitrak/yakitrak"
brew "act"
brew "webp"
brew "openssl@3"
brew "git"
brew "asdf"
brew "atuin", restart_service: :changed
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "awscli"
brew "bat"
brew "ccache"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "csvlens"
brew "deno"
brew "diff-so-fancy"
brew "duckdb"
brew "pkgconf"
brew "libtool"
brew "poppler"
brew "gh"
brew "git-lfs"
brew "go"
brew "handbrake"
brew "htop"
brew "imagemagick"
brew "jq"
brew "ldcli"
brew "libyaml"
brew "lsd"
brew "nasm"
brew "neonctl"
brew "neovim"
brew "ninja"
brew "ollama"
brew "openai-whisper"
brew "ripgrep"
brew "opencode"
brew "pipx"
brew "pnpm"
brew "postgis"
brew "postgresql@16"
brew "postgresql@17", restart_service: :changed
brew "promptfoo"
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "qt"
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "redis", restart_service: :changed
brew "skaffold"
brew "starship"
brew "temporal"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tor"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "antoniorodr/memo/memo"
brew "gromgit/fuse/bindfs-mac"
brew "heroku/brew/heroku"
brew "oven-sh/bun/bun"
brew "ramiawar/dataline/dataline"
brew "spinframework/tap/spin"
brew "steipete/tap/gogcli"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "supabase/tap/supabase"
brew "thoughtbot/formulae/parity"
brew "tursodatabase/tap/turso"
brew "tw93/tap/mole"
brew "yakitrak/yakitrak/obsidian-cli"
cask "affine"
cask "apparency"
cask "arc"
cask "bartender"
cask "block-goose"
cask "calibre"
cask "farion1231/ccswitch/cc-switch"
cask "chatgpt-atlas"
cask "codebolt"
cask "humanlayer/humanlayer/codelayer"
cask "cursor"
cask "deluge"
cask "railwaycat/emacsmacport/emacs-mac-spacemacs-icon"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "insomnia"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "loop"
cask "macfuse"
cask "markedit"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "raycast"
cask "setapp"
cask "slack"
cask "superhuman"
cask "suspicious-package"
cask "visual-studio-code@insiders"
cask "vlc"
cask "warp"
cask "xdevplatform/tap/xurl"
cask "zed"
cask "zettlr"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "artlaman.chalice-color-theme"
vscode "beardedbear.beardedtheme"
vscode "bierner.markdown-preview-github-styles"
vscode "castrogusttavo.symbols"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "databricks.neon-local-connect"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "itsjonq.owlet"
vscode "jdinhlife.gruvbox"
vscode "jnooree.semantic-noctis"
vscode "lazyvscode-theme.lazyvscode-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "mvllow.rose-pine"
vscode "openai.chatgpt"
vscode "pr1sm8.theme-panda"
vscode "prisma.prisma"
vscode "ripple-ts.ripple-ts-vscode-plugin"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.ruby-lsp"
vscode "sst-dev.opencode"
vscode "sst-dev.opencode-v2"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
