tap "d12frosted/emacs-plus"
tap "fermyon/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
tap "supabase/tap"
tap "thoughtbot/formulae"
brew "coreutils"
brew "libyaml"
brew "openssl@3"
brew "asdf"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "deno"
brew "gh"
brew "git"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "pnpm"
brew "poppler"
brew "postgresql@14", restart_service: true
brew "rcm"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "watchman"
brew "yarn"
brew "zsh"
brew "fermyon/tap/spin"
brew "oven-sh/bun/bun"
brew "supabase/tap/supabase"
cask "affine"
cask "apparency"
cask "arc"
cask "bartender"
cask "deluge"
cask "emacs-mac-spacemacs-icon"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "insomnia"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "raycast"
cask "setapp"
cask "superhuman"
cask "suspicious-package"
cask "visual-studio-code@insiders"
cask "warp"
cask "zed"
